genre_tag_mapping = {
    #사용자 입력 키워드 : 데이터베이스에 저장된 키워드
    
    "캐쥬얼": "캐주얼",
    
    "어드벤쳐": "어드벤처",
    "어드밴쳐": "어드벤처",
    "어드밴처": "어드벤처",

    "다크판타지" : "다크 판타지",
    
    "여주" : "여주인공",
    
    "피" : "유혈",
    "오픈월드" : "오픈 월드",
    "3D격투" : "3D 격투",
    "이스포츠" : "e스포츠",
    "RPG제작" : "RPG 제작",
    "다크" : "어두운",
    "드래곤" : "용",
    "손그림" : "손으로 그린",
    "호러" : "공포",
    "웨어울프" : "늑대인간",
    "소셜디덕션" : "소셜 디덕션",
    
    "액션RPG" : "액션 RPG",
    "액션RTS" : "액션 RTS",
    "전략RPG" : "전략 RPG",
    "전술RPG" : "전술 RPG",

    "액션어드벤처" : "액션 어드벤처",
    "액션어드벤쳐" : "액션 어드벤처",
    "액션어드밴처" : "액션 어드벤처",
    "액션어드밴쳐" : "액션 어드벤처",
    
    "RTS" : "실시간 전략",
    "RTT" : "실시간 전술",
    
    "파티게임" : "파티 게임",
    
    "게임개발" : "게임 개발",
    
    "어려운" : "고난이도",

    "시뮬" : "시뮬레이션",
    
    "개척시뮬" : "개척 시뮬레이션",
    "개척 시뮬" : "개척 시뮬레이션",
    "개척시뮬레이션" : "개척 시뮬레이션",
    
    "걷기시뮬" : "걷기 시뮬레이션",
    "걷기 시뮬" : "걷기 시뮬레이션",
    "걷기시뮬레이션" : "걷기 시뮬레이션",
   
    "농장시뮬" : "농장 시뮬레이션",
    "농장 시뮬" : "농장 시뮬레이션",
    "농장시뮬레이션" : "농장 시뮬레이션",

    "몰입형시뮬" : "몰입형 시뮬레이션",
    "몰입형 시뮬" : "몰입형 시뮬레이션",
    "몰입형시뮬레이션" : "몰입형 시뮬레이션",
    
    "생활시뮬" : "생활 시뮬레이션",
    "생활 시뮬" : "생활 시뮬레이션",
    "생활시뮬레이션" : "생활 시뮬레이션",
    
    "연애시뮬" : "연애 시뮬레이션",
    "연애 시뮬" : "연애 시뮬레이션",
    "연애시뮬레이션" : "연애 시뮬레이션",
    
    "우주시뮬" : "우주 시뮬레이션",
    "우주 시뮬" : "우주 시뮬레이션",
    "우주시뮬레이션" : "우주 시뮬레이션",
    
    "의학시뮬" : "의학 시뮬레이션",
    "의학 시뮬" : "의학 시뮬레이션",
    "의학시뮬레이션" : "의학 시뮬레이션",

    "아웃브레이크시뮬" : "아웃브레이크 시뮬레이션",
    "아웃브레이크 시뮬" : "아웃브레이크 시뮬레이션",
    "아웃브레이크시뮬레이션" : "아웃브레이크 시뮬레이션",

    "자동차시뮬" : "자동차 시뮬레이션",
    "자동차 시뮬" : "자동차 시뮬레이션",
    "자동차시뮬레이션" : "자동차 시뮬레이션",
    
    "정치시뮬" : "정치 시뮬레이션",
    "정치 시뮬" : "정치 시뮬레이션",
    "정치시뮬레이션" : "정치 시뮬레이션",
    
    "직업시뮬" : "직업 시뮬레이션",
    "직업 시뮬" : "직업 시뮬레이션",
    "직업시뮬레이션" : "직업 시뮬레이션",

    "기지건설" : "기지 건설",

    "레일슈팅" : "레일 슈팅",

    "배틀로얄" : "배틀 로얄"

    

   
}